# SQL Workshop: Part II

Welcome to the second part of this workshop. Here we will practice and explore more about JOINs. This notebook is structured in a way similar to the previous one and consists of challenges. The challenges will rise in difficulty as you go along. Good luck! 

For your convenience here is Sakila's ERD:

![sakila ERD](./SQLite3_Sakila_ERD.png)

### Challenge: Establishing a connection

Establish a connection with the Sakila database file called `sqlite-sakila.db`.

In [ ]:
# Your code here

In [2]:
# Import create_engine from sqlalchemy to connect to the database
from sqlalchemy import create_engine

# Import pandas
import pandas as pd

# Create an engine to the database sqlite-sakila.db
engine = create_engine(f"sqlite:///sqlite-sakila.db")

# Establish a connection to the database
conn = engine.connect()

### Challenge: JOINs I

Print out film titles and their inventory IDs.

In [ ]:
# Your code here

In [4]:
# Writing an SQL query 
query = """SELECT flm.title, inv.inventory_id
FROM film AS flm
LEFT JOIN inventory AS inv
    ON flm.film_id = inv.film_id"""

# Querying the database
pd.read_sql_query(query, conn)

                 title  inventory_id
0     ACADEMY DINOSAUR           1.0
1     ACADEMY DINOSAUR           2.0
2     ACADEMY DINOSAUR           3.0
3     ACADEMY DINOSAUR           4.0
4     ACADEMY DINOSAUR           5.0
...                ...           ...
4618         ZORRO ARK        4577.0
4619         ZORRO ARK        4578.0
4620         ZORRO ARK        4579.0
4621         ZORRO ARK        4580.0
4622         ZORRO ARK        4581.0

[4623 rows x 2 columns]

### Challenge: JOINs II

Print out inventory IDs and the address IDs of the stores they are stored in.

In [ ]:
# Your code here

In [8]:
# Writing an SQL query 
query = """SELECT inv.inventory_id, str.store_id
FROM inventory AS inv
LEFT JOIN store AS str
    ON str.store_id = inv.store_id"""

# Querying the database
pd.read_sql_query(query, conn)

      inventory_id  store_id
0                1         1
1                2         1
2                3         1
3                4         1
4                5         2
...            ...       ...
4576          4577         1
4577          4578         2
4578          4579         2
4579          4580         2
4580          4581         2

[4581 rows x 2 columns]

### Challenge: JOINs III

Print out all the payment amounts with the first and last names of our staff members who processed them.

In [ ]:
# Your code here

In [10]:
# Writing an SQL query 
query = """SELECT stf.first_name, stf.last_name, pym.amount
FROM staff AS stf
JOIN payment AS pym
    ON stf.staff_id = pym.staff_id"""

# Querying the database
pd.read_sql_query(query, conn)

      first_name last_name  amount
0           Mike   Hillyer    2.99
1           Mike   Hillyer    0.99
2           Mike   Hillyer    5.99
3            Jon  Stephens    0.99
4            Jon  Stephens    9.99
...          ...       ...     ...
16044       Mike   Hillyer    4.99
16045       Mike   Hillyer    1.99
16046        Jon  Stephens    8.99
16047        Jon  Stephens    2.99
16048        Jon  Stephens    2.99

[16049 rows x 3 columns]

### Challenge: JOINs IV

Print out the film title that has an inventory ID of 3456.

In [ ]:
# Your code here

In [6]:
# Writing an SQL query 
query = """SELECT flm.title AS title, inv.inventory_id AS inv_id
FROM film AS flm
LEFT JOIN inventory AS inv
    ON flm.film_id = inv.film_id
WHERE inv_id = 3456"""

# Querying the database
pd.read_sql_query(query, conn)

          title  inv_id
0  SAINTS BRIDE    3456

### Challenge: JOINs V

Print out all the inventory IDs of films rated "PG".

In [ ]:
# Your code here

In [11]:
# Writing an SQL query 
query = """SELECT inv.inventory_id AS title
FROM film AS flm
LEFT JOIN inventory AS inv
    ON flm.film_id = inv.film_id
WHERE flm.rating = 'PG'"""

# Querying the database
pd.read_sql_query(query, conn)

      title
0       1.0
1       2.0
2       3.0
3       4.0
4       5.0
..      ...
930  4538.0
931  4539.0
932  4540.0
933  4541.0
934  4542.0

[935 rows x 1 columns]

### Challenge: JOINs VI

Find the average payment amount processed by our staff member called Mike Hillyer.

In [ ]:
# Your code here

In [16]:
# Writing an SQL query 
query = """SELECT AVG(pym.amount) AS mean_pay
FROM staff AS stf
LEFT JOIN payment AS pym
    ON stf.staff_id = pym.staff_id
WHERE stf.last_name = 'Hillyer' AND stf.first_name = 'Mike'"""

# AND stf.first_name = 'Mike' is used to account for the situation where
# we might have had several people with the last name Hillyer

# Querying the database
pd.read_sql_query(query, conn)

   mean_pay
0  4.156568

### Challenge: JOINs VII

Find the average length of the films from our second store (ID = 2) that are rated "G".

In [ ]:
# Your code here

In [22]:
# Writing an SQL query 
query = """SELECT AVG(flm.length) AS mean_length
FROM film AS flm
LEFT JOIN inventory AS inv
    ON inv.film_id = flm.film_id
WHERE inv.store_id = 2 AND flm.rating = 'G'"""

# Querying the database
pd.read_sql_query(query, conn)

   mean_length
0     112.7733

### Challenge: JOINs VIII

Pint out the inventory ID of the film with the highest replacement cost among films not rated "NC-17", shorter than 2 hours, and released in 2006.

In [ ]:
# Your code here

In [5]:
# Writing an SQL query 
query = """SELECT inv.inventory_id
FROM film AS flm
LEFT JOIN inventory AS inv
    ON inv.film_id = flm.film_id
WHERE flm.rating != 'NC-17' AND (flm.length < 120) AND (flm.release_year = 2006)
ORDER BY flm.replacement_cost DESC
LIMIT 1"""

# Querying the database
pd.read_sql_query(query, conn)

   inventory_id
0           368